<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Book>
 */
class BookFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'name' => 'Rich Dad Poor Dad',
            'alternate_title' => 'ကမောင့်ချစ်သူ',
            'description' => 'လပ်တော့ (အင်္ဂလိပ်: laptop) သည် သေးငယ်၍ အလွယ်တကူ ပေါ့ပေါ့ပါးပါးသယ်ဆောင်သွားနိုင်သော တစ်ကိုယ်ရေသုံးကွန်ပျူတာ(အင်္ဂလိပ်: personal computer) ဖြစ်သည်။ Notebook သို့မဟုတ် Notebook Computer ဟုလည်း ခေါ်ကြသည်။ ၎င်းတွင် တံခါးပတ္တာကဲ့သို့ ခေါက်နိုင်ချိုးနိုင်သော မိုဘိုင်းဖုန်းများတွင် အသုံးပြုသည့် အရာပါရှိသည်။ အောက်ဘက်အပိုင်းတွင် ကီးဘုတ်ပါရှိ၍ အပေါ်ပိုင်းတွင် ပါးလွှာသော LCD သို့မဟုတ် LED ကွန်ပျူတာမျက်နှာပြင် တစ်ခုပါရှိသည်။ ကွန်ပျူတာကို အသုံးပြုရန် အပေါ်ပိုင်းကို ဖွင့်၍ သုံးရသည်။ လပ်တော့များသည် ခေါက်၍ပိတ်ကာ သယ်ဆောင်သွားနိုင်သည်။ မူလအစက လပ်တော့ နှင့် Notebook ကြားတွင် အရွယ်အစားကြီးမားခြင်း၊ လေးလံခြင်း စသော ခြားနားမှုများရှိသော်လည်း ၂၀၁၄ ခုနှစ်နောက်ပိုင်းမှစ၍ ကွဲပြားမှုမှာ မရှိတော့ပေ။ လပ်တော့များကို အလုပ်၊ ပညာရေး၊ ကိုယ်ရေးကိုယ်တာ ကိစ္စများ၊ အိမ်တွင် အသုံးပြုရန်အတွက်လည်း အသုံးပြုကြသည်။ လပ်တော့ (အင်္ဂလိပ်: laptop) သည် သေးငယ်၍ အလွယ်တကူ ပေါ့ပေါ့ပါးပါးသယ်ဆောင်သွားနိုင်သော တစ်ကိုယ်ရေသုံးကွန်ပျူတာ(အင်္ဂလိပ်: personal computer) ဖြစ်သည်။ Notebook သို့မဟုတ် Notebook Computer ဟုလည်း ခေါ်ကြသည်။ ၎င်းတွင် တံခါးပတ္တာကဲ့သို့ ခေါက်နိုင်ချိုးနိုင်သော မိုဘိုင်းဖုန်းများတွင် အသုံးပြုသည့် အရာပါရှိသည်။ အောက်ဘက်အပိုင်းတွင် ကီးဘုတ်ပါရှိ၍ အပေါ်ပိုင်းတွင် ပါးလွှာသော LCD သို့မဟုတ် LED ကွန်ပျူတာမျက်နှာပြင် တစ်ခုပါရှိသည်။ ကွန်ပျူတာကို အသုံးပြုရန် အပေါ်ပိုင်းကို ဖွင့်၍ သုံးရသည်။ လပ်တော့များသည် ခေါက်၍ပိတ်ကာ သယ်ဆောင်သွားနိုင်သည်။ မူလအစက လပ်တော့ နှင့် Notebook ကြားတွင် အရွယ်အစားကြီးမားခြင်း၊ လေးလံခြင်း စသော ခြားနားမှုများရှိသော်လည်း ၂၀၁၄ ခုနှစ်နောက်ပိုင်းမှစ၍ ကွဲပြားမှုမှာ မရှိတော့ပေ။ လပ်တော့များကို အလုပ်၊ ပညာရေး၊ ကိုယ်ရေးကိုယ်တာ ကိစ္စများ၊ အိမ်တွင် အသုံးပြုရန်အတွက်လည်း အသုံးပြုကြသည်။ လပ်တော့ (အင်္ဂလိပ်: laptop) သည် သေးငယ်၍ အလွယ်တကူ ပေါ့ပေါ့ပါးပါးသယ်ဆောင်သွားနိုင်သော တစ်ကိုယ်ရေသုံးကွန်ပျူတာ(အင်္ဂလိပ်: personal computer) ဖြစ်သည်။ Notebook သို့မဟုတ် Notebook Computer ဟုလည်း ခေါ်ကြသည်။ ၎င်းတွင် တံခါးပတ္တာကဲ့သို့ ခေါက်နိုင်ချိုးနိုင်သော မိုဘိုင်းဖုန်းများတွင် အသုံးပြုသည့် အရာပါရှိသည်။ အောက်ဘက်အပိုင်းတွင် ကီးဘုတ်ပါရှိ၍ အပေါ်ပိုင်းတွင် ပါးလွှာသော LCD သို့မဟုတ် LED ကွန်ပျူတာမျက်နှာပြင် တစ်ခုပါရှိသည်။ ကွန်ပျူတာကို အသုံးပြုရန် အပေါ်ပိုင်းကို ဖွင့်၍ သုံးရသည်။ လပ်တော့များသည် ခေါက်၍ပိတ်ကာ သယ်ဆောင်သွားနိုင်သည်။ မူလအစက လပ်တော့ နှင့် Notebook ကြားတွင် အရွယ်အစားကြီးမားခြင်း၊ လေးလံခြင်း စသော ခြားနားမှုများရှိသော်လည်း ၂၀၁၄ ခုနှစ်နောက်ပိုင်းမှစ၍ ကွဲပြားမှုမှာ မရှိတော့ပေ။ လပ်တော့များကို အလုပ်၊ ပညာရေး၊ ကိုယ်ရေးကိုယ်တာ ကိစ္စများ၊ အိမ်တွင် အသုံးပြုရန်အတွက်လည်း အသုံးပြုကြသည်။',
            'isbn' => '98273620323',
            'pages' => '440',
            'status' => 'active',
            'image' => fake()->imageUrl(1080, 1080, 'animals'),
            'stock_quantity' => 30,
            'original_price' => 14500,
            'sell_price' => 14500,
            'published_date' => 'Nov 4, 2023',
            'category_id' => 1,
            'author_id' => 1,
        ];
    }
}
